testCase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    Wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        
  	
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    
	/*type          pressureInletOutletVelocity;
	phi	      phi;		
        value         $internalField;       
       /* type            inletOutlet; 
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);*/
	// type		zeroGradient;
    }
axis1
	{
		type    symmetryPlane;
	}
axis2
	{
		type    symmetryPlane;
	}
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
